canerceliktas/nrf5_BLE_Services_and-Characteristics_with_Peripheral/main.c
}


/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;
    // Initialize.
    log_init();
    
    ret_code_t ret;
    
    serial_uart_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    saadc_init();
    services_init();
    advertising_init();

    conn_params_init();
    peer_manager_init();

    // Start execution.
    NRF_LOG_INFO("OurCharacteristics tutorial started.");
    application_timers_start();

    advertising_start(erase_bonds);

    // Enter main loop.
    for (;;)
    {
        idle_state_handle(); 

        char c;
        char rx_message[5];
        ret = nrf_serial_read(&serial_uart, &c, sizeof(c), NULL, 1000);
        if (ret != NRF_SUCCESS)
        { 
            continue;
        }
        (void)nrf_serial_write(&serial_uart, &c, sizeof(c), NULL, 0);
        (void)nrf_serial_flush(&serial_uart, 0);

        if(c==0x31)
        nrf_gpio_pin_toggle(LED_1);
        else if(c==0x32)
        nrf_gpio_pin_toggle(LED_2);
        else if (c==0x33)
        nrf_gpio_pin_toggle(LED_3);
        else if (c==0x34)
        nrf_gpio_pin_toggle(LED_4);
        else if (c==0x35)
        {
        nrf_gpio_pin_toggle(LED_1);
        nrf_gpio_pin_toggle(LED_2);
        nrf_gpio_pin_toggle(LED_3);
        nrf_gpio_pin_toggle(LED_4);
        }
        else
        {
        nrf_gpio_pin_set(LED_1);
        nrf_gpio_pin_set(LED_2);
        nrf_gpio_pin_set(LED_3);
        nrf_gpio_pin_set(LED_4);
        }   
    }
}


/**
 * @}
 */
